

const initPanelsLayout = [
  {"i":"552789263395020803","x":44,"y":3,"w":35,"h":8,"name":"常用应用","moved":false},
  {"i":"552789263395020805","x":8,"y":11,"w":35,"h":9,"name":"我的日程","moved":false},
  {"i":"879380741260567087","x":44,"y":11,"w":35,"h":9,"name":"个人信息","moved":false},
  {"i":"1539917557128642561","x":8,"y":0,"w":17,"h":3,"name":"查看凭证","moved":false},
  {"i":"1540290343110238575","x":26,"y":0,"w":17,"h":3,"name":"科目余额表","moved":false},
  {"i":"1540290343110238886","x":44,"y":0,"w":17,"h":3,"name":"资产负债表","moved":false},
  {"i":"1540290343110238889","x":62,"y":0,"w":17,"h":3,"name":"利润表","moved":false},
  {"i":"1544364360108785687","x":8,"y":3,"w":35,"h":8,"name":"新增凭证","moved":false}
];

const  demo = {
  i: "0", // 索引值 必填
  h: 4,   // 高度   必填
  w: 7,   // 宽度   必填
  x: 2,   // x 轴距离 必填
  y: 0,   // y轴距离 必填
  minW:5, // 最小宽度 当 w的值小于minW时 采用minW的值
  minH:3, // 同上
  maxW:8, // 的最大宽度。如果w大于maxW，那么w将被设置为maxW。
  maxH:6, // 同上
  isDraggable:true, // 单独控制这一个盒子是否可以拖动 未填写 继承父元素的 非必填
  isResizable:true, // 单独控制这一个盒子是否可以调整大小 未填写 继承父元素的 非必填
  static:false, // 这个盒子是静态的  不能被其他元素改变位置 会被覆盖在底部
  dragIgnoreFrom: '', // 属性这值为css 选择器 项的哪些元素不应触发项的拖动事件// 具体不知道干嘛的 没有用到
  dragAllowFrom:'', // 属性这值为css 选择器 项的哪些元素应触发项的拖动事件 // 文档这样写的
  resizeIgnoreFrom:'',//属性这值为css 选择器 表示项的哪些元素不应触发项的调整大小事件。//来自文档翻译
};

export { initPanelsLayout }
